{
  "luteal_grounding": {
    "title": "Luteal Phase Grounding",
    "duration": "7 minutes",
    "script": "Close your eyes. Take a deep breath in through your nose... and out through your mouth. We're entering your alpha state now. Five... Feel your body beginning to relax. Four... Your breath slows naturally. Three... Thoughts begin to quiet. Two... You are entering your inner sanctuary. One... You are now in alpha.\n\nIf you're in your luteal phase right now, you might notice your body feels heavier. That's progesterone. This is not weakness. This is your body preparing for rest. Your body knows exactly what it's doing.\n\nImagine roots growing from the soles of your feet, deep into the earth. With each exhale, those roots grow deeper. You are grounded. You are held. The earth is supporting you right now.\n\nBring your attention to your lower belly. This is where your womb lives. Your uterus is preparing its lining. Your body is doing invisible work. Honor this. Place your hand on your belly. Feel the warmth. This is sacred ground.\n\nNow we'll do a body scan. Start with your toes. Wiggle them gently. Notice any tension. Breathe into your feet. Release. Move up to your calves. Soften them. Your knees. Your thighs. Let them be heavy.\n\nYour hips. Your lower back. This is where you hold stress. Breathe into your pelvis. Imagine warm honey flowing through your hips, melting away tension. Your lower back softens.\n\nYour belly. Your chest. Your heart. Place both hands on your heart now. Feel it beating. This heart has been beating since before you were born. It knows how to keep you alive. Trust it.\n\nYour shoulders. So much weight lives here. Roll them back. Down. Release. Your neck. Your jaw. Unclench. Your face. Your forehead. Smooth.\n\nYou are completely relaxed now. From the crown of your head to the soles of your feet. You are in your body. You are safe. You are grounded.\n\nIn your luteal phase, you are turning inward. This is natural. This is right. You don't need to be productive. You don't need to be social. You can rest.\n\nRepeat after me, in your mind: I honor my body's rhythms. I trust my cycle. I am allowed to slow down. My worth is not measured by my output.\n\nStay here as long as you need. When you're ready, take three deep breaths. Wiggle your fingers and toes. Open your eyes. You are grounded. You are whole. You are exactly where you need to be."
  },
  "sleep_induction": {
    "title": "Sleep Induction",
    "duration": "10 minutes",
    "script": "You are safe. Your body knows how to sleep. You've done this thousands of times before. Tonight will be no different. Close your eyes now. You won't open them again until morning.\n\nTake a deep breath in... two, three, four. Hold... two, three, four. Exhale... two, three, four, five, six, seven, eight. Again. Breathe in... two, three, four. Hold. Exhale slowly... eight full counts. One more time. Your breath is slowing. Your heart rate is dropping. Your body is preparing for sleep.\n\nFive... Your body is heavy, sinking into the bed. Four... Your breath slows naturally. Three... Your mind begins to drift. Two... You are entering the threshold of sleep. One... Deep rest is coming.\n\nLet's begin progressive relaxation. Start with your right foot. Tense it. Squeeze all the muscles. Hold... three, two, one. Release. Feel the tension melt away. Notice the difference. That's what relaxation feels like.\n\nNow your left foot. Tense. Squeeze. Hold. Release. Both feet are relaxed now. Heavy. They've carried you all day. They can rest now.\n\nYour right calf. Tense the muscle. Hold it. Feel the tightness. Now release. Let it go completely. Your left calf. Tense. Hold. Release. Both legs are heavy now. Sinking into the mattress.\n\nYour thighs. Tense both at once. Squeeze. Hold for three seconds. Now let go. Feel the wave of relaxation wash over your legs. They are so heavy now. You couldn't move them if you tried.\n\nYour hips. Your buttocks. Clench them tight. Hold. Release. Your pelvis sinks into the bed. Your lower back. Arch it slightly. Feel the tension. Now release. Your spine flattens. Your back is supported.\n\nYour belly. Pull it in tight. Hold your breath. Now exhale and release completely. Your belly is soft. Breathing happens on its own now. You don't need to think about it.\n\nYour chest. Inhale deeply. Expand your ribcage. Hold. Now exhale fully and release. Your chest rises and falls on its own. Slow. Steady. Like waves on a shore.\n\nYour hands. Make fists. Tight. Tighter. Hold. Now release. Your fingers uncurl. Your palms open. Your hands are heavy. They rest beside you.\n\nYour arms. Tense them both. Flex your biceps. Hold. Release. Your arms are so heavy now. They sink into the sheets.\n\nYour shoulders. Raise them up to your ears. Scrunch. Hold all that tension. Now drop them. Let them fall. All the weight of the day falls away.\n\nYour neck. Tilt your head back slightly. Feel the stretch. Now relax. Your head sinks into the pillow. Perfectly supported.\n\nYour jaw. Clench your teeth. Tight. Hold. Now let your mouth fall open slightly. Your jaw is loose. Your tongue rests at the bottom of your mouth.\n\nYour face. Scrunch everything toward the center. Eyes shut tight. Nose wrinkled. Mouth pursed. Hold. Now release. Your face is smooth. Peaceful. Like a child's face in sleep.\n\nYour entire body is relaxed now. From your toes to your scalp. Every muscle is loose. You are completely at rest.\n\nNow imagine you're at the top of a staircase. Ten steps down to sleep. Each step takes you deeper. Ten... you take the first step down. Your body feels heavier. Nine... stepping down. You're more relaxed. Eight... going deeper. Seven... halfway there. Your mind is quieter. Six... almost there. Five... so close to sleep. Four... your thoughts are fading. Three... you're drifting now. Two... almost gone. One... you're at the threshold. Zero... you're asleep.\n\nSleep now. Deep, restful, healing sleep. Your body will repair itself tonight. Your mind will process the day. You will wake refreshed. But for now, sleep. Just sleep."
  },
  "habit_installation": {
    "title": "Habit Installation",
    "duration": "5 minutes",
    "script": "Close your eyes. We're going to install a new habit tonight. This isn't just positive thinking. This is subconscious programming. Your identity is about to shift.\n\nFive... Relaxing deeply. Four... Breath slowing naturally. Three... Thoughts quieting. Two... Entering your inner sanctuary. One... You are now in alpha. Receptive. Open. Ready.\n\nIn your mind, see your future self. Six months from now. This version of you has the habit you want. It's automatic. Effortless. What do they look like? How do they move? What do they believe about themselves?\n\nThis isn't fantasy. This is your inevitable future. You're not trying to become this person. You already are this person. You're just remembering.\n\nLet's use the Atomic Habits framework. Every habit has a cue, a routine, and a reward. First, the cue. What triggers your habit? Is it a time of day? A location? An emotion? See it clearly now. This is your signal.\n\nNow the routine. See yourself doing the action. Make it small. So small you can't fail. Don't see yourself running a marathon. See yourself putting on running shoes. That's the habit. The identity shift happens in that tiny moment.\n\nWatch yourself do it. See the details. What are you wearing? Where are you? How does it feel in your body? Make it real. Your subconscious doesn't know the difference between imagination and reality. You're rewiring your brain right now.\n\nNow the reward. What do you get from this? Not external rewards. Internal ones. How do you feel after? Proud? Calm? Strong? Lock that feeling in. This is what you're craving. The habit is just the path to this feeling.\n\nRepeat your identity statement three times. In your mind, say: I am someone who [your habit]. Say it again. I am someone who [your habit]. One more time. I am someone who [your habit]. You're not trying to be this person. You are this person.\n\nNow we'll anchor it. In a moment, I'll count from one to five. When I reach five, you'll touch your thumb and forefinger together. This is your trigger. Every time you touch these fingers together, you'll remember who you are. You'll remember your identity.\n\nOne... the anchor is forming. Two... it's getting stronger. Three... almost locked in. Four... nearly there. Five... touch your fingers together now. Feel the click. This is you. This is who you've always been.\n\nWhen you wake up tomorrow, you won't remember this session consciously. But your subconscious will remember. The first time you see your cue, you'll act automatically. No willpower needed. It's just who you are.\n\nNow take three deep breaths. On the third breath, open your eyes. You are different now. The change has already happened. Welcome home."
  },
  "anxiety_reset": {
    "title": "90-Second Anxiety Reset",
    "duration": "90 seconds",
    "script": "This feeling is temporary. You are safe right now. Your nervous system is firing alarm signals, but there is no actual danger. We're going to reset it together.\n\nPlace one hand on your heart. One hand on your belly. Feel them both moving. You are in your body. You are here. You are now.\n\nBreathe in for five. One, two, three, four, five. Hold for five. One, two, three, four, five. Exhale for seven. One, two, three, four, five, six, seven. Again. In for five. Hold for five. Out for seven. Your nervous system is shifting. From fight-or-flight to rest-and-digest.\n\nLook around. Name five things you can see. Four things you can touch. Three things you can hear. Two things you can smell. One thing you can taste. You are here. You are present. You are safe.\n\nThe anxiety is not you. It's weather passing through. You are the sky. Clouds come and go. You remain. This will pass. It always does. Breathe. You've survived one hundred percent of your worst days. Today will be no different.\n\nOne more deep breath. In through your nose. Out through your mouth. Soften your shoulders. Unclench your jaw. You're okay. You're going to be okay."
  },
  "body_acceptance": {
    "title": "Body Acceptance",
    "duration": "7 minutes",
    "script": "Close your eyes. Your body is not the enemy. Your cycle is not a curse. Today we're going to make peace with the vessel that carries you through life.\n\nFive... Your body relaxes. Four... Your breath finds its rhythm. Three... Thoughts quiet. Two... You enter your sanctuary. One... Your heart is open.\n\nPlace your hands on your body. Anywhere. Your belly. Your thighs. Your chest. These hands belong to you. This body belongs to you. No one else gets a vote.\n\nYour body is doing a million things right now to keep you alive. Your heart is beating without you asking. Your lungs are breathing. Your cells are dividing. Your immune system is fighting. Your hormones are cycling. This is a miracle.\n\nYou've been at war with this body. Measuring it. Punishing it. Trying to shrink it. Hating it for changing with your cycle. Today, the war ends.\n\nThink about your menstrual phase. Your body is shedding. Releasing. This is not failure. This is renewal. Your uterus is preparing for next month. It's pruning the garden. This blood is not dirty. It's sacred. It's life force.\n\nYour follicular phase. Estrogen is rising. You feel lighter. This isn't the 'real' you. This is one version. All your versions are real. You are allowed to be multiple things.\n\nOvulation. Your body is fertile. Radiant. You might feel powerful. Sexy. This is your body's peak. But you are not only valuable when you're ovulating. You are valuable in every phase.\n\nYour luteal phase. Progesterone is rising. You might feel heavier. Slower. Moodier. This is not broken. This is your body telling you to rest. Listen. For once, just listen.\n\nYour body changes. Every day. Every week. Every month. Every year. This is not failure. This is being alive. Trees change with seasons. So do you. It's natural. It's right.\n\nLet's send gratitude to each part of your body. Start with your feet. Thank you, feet, for carrying me. Even when I ignore you. Even when I stuff you in uncomfortable shoes. Thank you.\n\nYour legs. Thank you for being strong. For moving me through space. I'm sorry I've criticized your size. Your shape. You are perfect. You are mine.\n\nYour belly. Oh, your belly. The part you've hated most. Thank you. Thank you for digesting my food. For housing my organs. For softening when I need comfort. I'm sorry I've punished you. You are not too much. You are exactly right.\n\nYour chest. Your heart. Thank you for beating. For feeling. For breaking and healing and breaking again. You are brave.\n\nYour arms. Thank you for holding. For reaching. For creating. You are capable.\n\nYour face. Thank you for expressing. For smiling. For crying. For showing the world who I am. You are beautiful. Not because of symmetry. Because you're mine.\n\nYour womb. Whether you've bled, or birthed, or neither. Thank you. You are the center of my power. My creativity. My intuition. I honor you.\n\nNow say this with me: My body is not the problem. Diet culture is the problem. Patriarchy is the problem. I am not broken. I am cyclical. I am seasonal. I am whole.\n\nI accept my body today. Not when I lose weight. Not when my skin clears. Not when my cycle regulates. Today. Right now. As is.\n\nTake three deep breaths. Place both hands on your heart. Feel it beating. This body loves you. It's trying so hard to keep you alive. Love it back. Even just a little. Start there.\n\nWhen you open your eyes, look at yourself differently. You are not a project to fix. You are a person to love. Begin now."
  }
}
